#define _CRT_SECURE_NO_WARNINGS 1 
#include<stdio.h>
int main()
{
	int n = 9; //9的二进制 0000 0000 0000 0000 0000 0000 0000 1001  
	           //浮点数就写为  （-1）^0*0.00000000000000000001001*2^（-126）显然是个很小的数
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("pFloat的值为：%f\n", *pFloat);//所有这里存0.00000000
	*pFloat = 9.0;//9.0  1001.0  （-1）^0*0.001*2*3  s=0 M=1.001 E=3+127=130 即二进制 0 10000010 001 0000 0000 0000 0000 0000
	printf("num的值为：%d\n", n); //0 10000010 001 0000 0000 0000 0000 0000 转化为10进制1091567616
	printf("*pFloat的值为：%f\n", *pFloat); 
	return 0;
}
//int check_sys()//大端小端判断
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		return 1;//小端
//	else
//		return 0;//大端
//}
//int main()
//{
//	if (check_sys() == 1)
//	{
//		printf("小端");
//	}
//	else
//	{
//		printf("大端");
//	}
//	return 0;
//}
//int main()
//{
//	int a = 20;//正数原、反、补码相同
//	//原码  00000000000000000000000000010100
//	//反码  00000000000000000000000000010100
//	//补码  00000000000000000000000000010100
//	//16进制   0x00000014
//	int b = -10;
//	//原码  00000000000000000000000000001010
//	//反码  01111111111111111111111111110101
//	//补码  01111111111111111111111111110110
//	//16进制    0xfffffff6
//	return 0;
//}
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//int main()
//{
//	int A = 0;
//	int B = 0;
//	int C = 0;
//	int D = 0;
//	int E = 0;
//	for (A = 1; A <= 5; A++)
//	{
//		for (B = 1; B <= 5; B++)
//		{
//			for (C = 1; C <= 5; C++)
//			{
//				for (D = 1; D <= 5; D++)
//				{
//					for (E = 1; E <= 5; E++)
//					{
//						if ((A*B*C*D*E == 120) && (A + B + C + D + E == 15))
//						{
//							if (((B == 2) + (A == 3) == 1) && ((B == 2) + (E == 4) == 1) && ((C == 1) + (D == 2) == 1) && ((C == 5) + (D == 3) == 1) && ((E == 4) + (A == 1) == 1))
//							{
//								printf("A=%d B=%d C=%d D=%d E=%d ", A, B, C, D, E);
//							}
//						}
//					}
//				}
//			}
//		}
//		
//	}
//	return 0;
//}
//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词 :
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	int murder = 0;
//	for (murder = 'A'; murder <= 'D'; murder++)
//	{
//		if (((murder != 'A') + (murder == 'C') + (murder == 'D') + (murder != 'D') == 3))
//		{
//			printf("%c", murder);
//		}
//	}
//	return 0;
//}
//int main()//数组指针
//{
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int(*p)[10] = &arr;
//	for (int i = 0; i < 10; i++)
//	{
//		printf("%d", (*p)[i]);
//	}
//	return 0;
//}